wisteria-1c/Конфигурация/InformationRegisters/ЭтапыСогласованияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыСогласованияЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВРаботе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяВРаботеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСогласования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ЭтапыСогласованияЗаявок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновить этап согласования заявки
// 
// Параметры:
//  Пользователь			- СправочникСсылка.Пользователи 			  - пользователь
//  Документ 				- ДокументСсылка.РасходДСПлан				  - заявка на расход денег
//  ВидОперацииСогласования - ПеречислениеСсылка.ВидыОперацийСогласования - вид операции согласования
//  Комментарий 			- Строка, Неопределено 						  - комментарий
//
Процедура ОбновитьЭтапСогласованияЗаявки(Пользователь, Документ, ВидОперацииСогласования, Комментарий = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ЗаявкаНаРасходДС", Документ);
	СрезЗначений = СрезПоследних(,Отбор);
	СрезЗначений.Сортировать("Период");
	Если СрезЗначений.Количество() <> 0 Тогда
		ПериодПоследнейЗаписи = СрезЗначений[СрезЗначений.Количество() - 1].Период;
	Иначе
		ПериодПоследнейЗаписи = ТекущаяДата;
	КонецЕсли;
		
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.ЗаявкаНаРасходДС.Установить(Документ);
	НаборЗаписей.Отбор.ВидОперацииСогласования.Установить(ВидОперацииСогласования);
				
	Запись = НаборЗаписей.Добавить();
	
	Запись.Период = ТекущаяДата;
	Запись.Пользователь = Пользователь;
	Запись.ЗаявкаНаРасходДС = Документ;
	Запись.ВидОперацииСогласования = ВидОперацииСогласования;
	Запись.ВремяВРаботе = ТекущаяДата - ПериодПоследнейЗаписи;
	Запись.ВремяВРаботеСтрока = Отчеты.СтатистикаСогласованияЗаявок.ПолучитьВремяВРаботеСтрокой(Запись.ВремяВРаботе);;
	Запись.Комментарий = Комментарий;
				
	НаборЗаписей.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Сформировать список значений действий.
// 
// Параметры:
//  Документ - ДокументСсылка.РасходДСПлан - заявка на расход ДС
// 
// Возвращаемое значение:
//  СписокЗначений из Строка - Сформировать строку действий
//
Функция СформироватьСписокЗначенийДействийСЗаявкой(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапыСогласованияЗаявок.Период,
		|	ЭтапыСогласованияЗаявок.Пользователь,
		|	ЭтапыСогласованияЗаявок.ВидОперацииСогласования,
		|	ЭтапыСогласованияЗаявок.Комментарий
		|ИЗ
		|	РегистрСведений.ЭтапыСогласованияЗаявок КАК ЭтапыСогласованияЗаявок
		|ГДЕ
		|	ЭтапыСогласованияЗаявок.ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС";
	
	Запрос.УстановитьПараметр("ЗаявкаНаРасходДС", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокЗначений = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл
		
		
		ШаблонСтроки = НСтр("ru ='%1 
						    |Заявка %2 пользователем %3'");
						    
		Если ЗначениеЗаполнено(Выборка.Комментарий) Тогда
			
			ШаблонСтроки = ШаблонСтроки + Символы.ПС + НСтр("ru = 'Комментарий:
															|%4'");
			
		КонецЕсли;
		
		СтрокаПериод = Выборка.Период;
		СтрокаВидОперации = Нрег(Выборка.ВидОперацииСогласования);
		СтрокаПользователь =  Выборка.Пользователь;
		СтрокаКомментарий = Выборка.Комментарий;
		
		ФорматированнаяСтрока =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки,
																						 СтрокаПериод,
																						 СтрокаВидОперации,
																						 СтрокаПользователь,
																						 СтрокаКомментарий);
		
		СписокЗначений.Добавить(ФорматированнаяСтрока);
		
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
